# 导入必要模块
import cv2
import numpy as np

from utils.plots import plot_one_box

a = [[1.63100e+03, 5.27000e+02, 1.65600e+03, 5.55000e+02, 7.37299e-01, 0.00000e+00],
     [6.18000e+02, 5.08000e+02, 6.43000e+02, 5.37000e+02, 6.05086e-01, 0.00000e+00],
     [1.29000e+02, 7.40000e+01, 1.65000e+02, 1.17000e+02, 2.92030e-01, 0.00000e+00]]
b = [[9.19000e+02, 7.31000e+02, 9.47000e+02, 7.61000e+02, 7.10782e-01, 0.00000e+00],
     [5.47000e+02, 1.05000e+03, 5.72000e+02, 1.07900e+03, 5.72106e-01, 0.00000e+00],
     [1.60200e+03, 6.69000e+02, 1.63300e+03, 7.08000e+02, 3.29563e-01, 0.00000e+00]]
c = [[1.71600e+03, 5.64000e+02, 1.76000e+03, 6.18000e+02, 7.78139e-01, 0.00000e+00],
     [1.41600e+03, 5.92000e+02, 1.44800e+03, 6.32000e+02, 5.69263e-01, 0.00000e+00],
     [1.45200e+03, 6.93000e+02, 1.48900e+03, 7.35000e+02, 3.33542e-01, 0.00000e+00],
     [1.67300e+03, 6.87000e+02, 1.72800e+03, 7.46000e+02, 2.68826e-01, 0.00000e+00]]
d = [[9.51000e+02, 6.92000e+02, 9.73000e+02, 7.21000e+02, 5.96407e-01, 0.00000e+00],
     [5.46000e+02, 1.04900e+03, 5.72000e+02, 1.07800e+03, 4.10367e-01, 0.00000e+00],
     [1.60100e+03, 6.71000e+02, 1.63300e+03, 7.10000e+02, 3.28861e-01, 0.00000e+00]]

img = cv2.imread(r"C:\Users\10\Desktop\yolov5-master\image1\10.png")  # 读取图片路径
img_hsv = cv2.cvtColor(img, cv2.COLOR_BGR2HSV)  # 将BGR图像转换为HSV格式
print(img_hsv.shape)  #  H W C



lower_color = np.array([26, 43, 46])  # 分别对应着HSV中的最小值
upper_color = np.array([34, 255, 255])  # 分别对应着HSV中的最大值
mask = cv2.inRange(img_hsv, lower_color, upper_color)  # inrange函数将根据最小最大HSV值检测出自己想要的颜色部分

print('mask :',mask.shape)
for i in mask:
    for j in i:
        if(j) :
            print(j)
k = 0
for xyxy in d:
    k = k + 1
    plot_one_box(xyxy, mask, label='test', color=[255, 0, 0],
                 line_thickness=2)

cv2.imshow("mask", mask)  # 通过imshow显示
cv2.waitKey(0)  # 等待键盘按下按键退出
